<?PHP
#---------------------------------------------------------------------------------------------------------
# Помощь/Настройка/Установка/Раскрутка проектов - Skype: admin.superoc | vk.com/superoc
#---------------------------------------------------------------------------------------------------------
# Счетчик
#---------------------------------------------------------------------------------------------------------
function TimerSet(){
list($seconds, $microSeconds) = explode(' ', microtime());
return $seconds + (float) $microSeconds;
}
$_timer_a = TimerSet();

#---------------------------------------------------------------------------------------------------------
# Старт сессии
#---------------------------------------------------------------------------------------------------------
@session_start();

#---------------------------------------------------------------------------------------------------------
# Старт буфера
#---------------------------------------------------------------------------------------------------------
@ob_start();

#---------------------------------------------------------------------------------------------------------
# Главные настройки проекта Default
#---------------------------------------------------------------------------------------------------------
$_OPTIMIZATION = array();
$_OPTIMIZATION["title"] = "Taxi Cash | монетизация сайта";
$_OPTIMIZATION["description"] = "монетизация сайта";
$_OPTIMIZATION["keywords"] = "taxi cash,igry,ekonomy igry";

#---------------------------------------------------------------------------------------------------------
# Константа для Include
#---------------------------------------------------------------------------------------------------------
define("CONST_RUFUS", true);

#---------------------------------------------------------------------------------------------------------
# Автоподгрузка классов
#---------------------------------------------------------------------------------------------------------
function __autoload($name){ include("classes/_class.".$name.".php");}

#---------------------------------------------------------------------------------------------------------
# Класс конфига 
#---------------------------------------------------------------------------------------------------------
$config = new config;

#---------------------------------------------------------------------------------------------------------
# Функции
#---------------------------------------------------------------------------------------------------------
$func = new func;

#---------------------------------------------------------------------------------------------------------
# Анти-Дос защита для проекта
#---------------------------------------------------------------------------------------------------------


#---------------------------------------------------------------------------------------------------------
# Установка реферер
#---------------------------------------------------------------------------------------------------------
include("inc/_set_referer.php");

#---------------------------------------------------------------------------------------------------------
# База данных
#---------------------------------------------------------------------------------------------------------
$db = new db($config->HostDB, $config->UserDB, $config->PassDB, $config->BaseDB);

#---------------------------------------------------------------------------------------------------------
# Верхняя часть проекта
#---------------------------------------------------------------------------------------------------------

if(isset($_GET["menu"])){
$menu = strval($_GET["menu"]);
switch($menu){

#---------------------------------------------------------------------------------------------------------
# Автоподключение страниц проекта
#---------------------------------------------------------------------------------------------------------	
case "404": include("pages/_404.php"); break;                            // Страница ошибки
case "adm0shik": include("pages/_admin.php"); break;                     // Страница админки
case "stats": include("pages/_stats.php"); break;                     // Страница админки

case "news": include("pages/_news.php"); break;                          // Новости проекта
case "rules": include("pages/_rules.php"); break;                        // Правила проекта
case "about": include("pages/_about.php"); break;                        // Об игре
case "contacts": include("pages/_contacts.php"); break;                  // Связь/Вопросы
case "top": include("pages/_top.php"); break;
case "signup": include("pages/_signup.php"); break;                      // Регистрация на проекте
case "login": include("pages/_login.php"); break;                      // Регистрация на проекте
case "recovery": include("pages/_recovery.php"); break;                  // Восстановление пароля
case "account": include("pages/_account.php"); break;                    // Настроки аккаунта
case "payments": include("pages/_payments_list.php"); break;             // Последние выплаты
case "competition": include("pages/_competition.php"); break;            // Конкурс Рефералов
case "success": include("pages/_success.php"); break;                          // Success
case "fail": include("pages/_fail.php"); break;                          // fail

#---------------------------------------------------------------------------------------------------------
# Страница ошибки
#---------------------------------------------------------------------------------------------------------
default: @include("pages/_404.php"); break;
}
}else @include("pages/_index.php");

#---------------------------------------------------------------------------------------------------------
# Нижняя часть проекта
#---------------------------------------------------------------------------------------------------------
@include("inc/_footer.php");

#---------------------------------------------------------------------------------------------------------
# Заносим контент в переменную
#---------------------------------------------------------------------------------------------------------
$content = ob_get_contents();

#---------------------------------------------------------------------------------------------------------
# Очищаем буфер
#---------------------------------------------------------------------------------------------------------
ob_end_clean();

#---------------------------------------------------------------------------------------------------------
# Заменяем данные
#---------------------------------------------------------------------------------------------------------
$content = str_replace("{!TITLE!}",$_OPTIMIZATION["title"],$content);
$content = str_replace('{!DESCRIPTION!}',$_OPTIMIZATION["description"],$content);
$content = str_replace('{!KEYWORDS!}',$_OPTIMIZATION["keywords"],$content);
$content = str_replace('{!GEN_PAGE!}', sprintf("%.5f", (TimerSet() - $_timer_a)) ,$content);

#---------------------------------------------------------------------------------------------------------
# Вывод баланса
#---------------------------------------------------------------------------------------------------------
if(isset($_SESSION["user_id"])){	
$user_id = $_SESSION["user_id"];
$db->Query("SELECT money_b, money_p, money_b, pay_serf FROM db_users_b WHERE id = '$user_id'");
$balance = $db->FetchArray();
$content = str_replace('{!BALANCE_B!}', sprintf("%.2f", $balance["money_b"]) ,$content);
$content = str_replace('{!BALANCE_P!}', sprintf("%.2f", $balance["money_p"]) ,$content);
$content = str_replace('{!BALANCE_SERF!}', sprintf("%.2f", $balance["money_b"]) ,$content);
$content = str_replace('{!BALANCE_PAY!}', sprintf("%.2f", $balance["pay_serf"]) ,$content);
}
	
// Выводим контент
echo $content;
?>